import { Component } from '@angular/core';

@Component({
  templateUrl: './tip-valid-position-test.html',
  styleUrls: ['./tipTest.less']
})
export class TipValidPositionTestComponent {
  tipStr11: string = '寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍';
  tipStr12: string =
    '苦苦地寻寻觅觅，却只见冷冷清清，怎不让人凄惨悲戚。乍暖还寒的时节，最难保养休息。喝三杯两杯淡酒，怎么能抵得住早晨的寒风急袭？一行大雁从眼前飞过，更让人伤心，因为都是旧日的相识。' +
    '园中菊花堆积满地，都已经憔悴不堪，如今还有谁来采摘？冷清清地守着窗子，独自一个人怎么熬到天黑？梧桐叶上细雨淋漓，到黄昏时分，还是点点滴滴。这般情景，怎么能用一个愁字了结！';
  tipStr13: string =
    '苦苦地寻寻觅觅，却只见冷冷清清，怎不让人凄惨悲戚。乍暖还寒的时节，最难保养休息。喝三杯两杯淡酒，怎么能抵得住早晨的寒风急袭？一行大雁从眼前飞过，更让人伤心，因为都是旧日的相识。';
  tipStr21: string =
    '苦苦地寻寻觅觅，却只见冷冷清清，怎不让人凄惨悲戚。乍暖还寒的时节，最难保养休息。喝三杯两杯淡酒，怎么能抵得住早晨的寒风急袭？一行大雁从眼前飞过，更让人伤心，因为都是旧日的相识。';
  tipStr22: string =
    '苦苦地寻寻觅觅，却只见冷冷清清，怎不让人凄惨悲戚。乍暖还寒的时节，最难保养休息。喝三杯两杯淡酒，怎么能抵得住早晨的寒风急袭？一行大雁从眼前飞过，更让人伤心，因为都是旧日的相识。';
  tipStr31: string = '寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍';
  tipStr32: string =
    '苦苦地寻寻觅觅，却只见冷冷清清，怎不让人凄惨悲戚。乍暖还寒的时节，最难保养休息。喝三杯两杯淡酒，怎么能抵得住早晨的寒风急袭？一行大雁从眼前飞过，更让人伤心，因为都是旧日的相识。';
  tipStr33: string = '寻寻觅觅，冷冷清清，凄凄惨惨戚戚。乍';
}
